Revit 2027 API
DefaultDivideSettings.GetDefaultDivideSettings Method
 Obtains the DefaultDivideSettings object for the specified document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static DefaultDivideSettings GetDefaultDivideSettings(
	Document cda
)
Public Shared Function GetDefaultDivideSettings (
	cda As Document
) As DefaultDivideSettings
public:
static DefaultDivideSettings^ GetDefaultDivideSettings(
	Document^ cda
)
static member GetDefaultDivideSettings :
        cda : Document -> DefaultDivideSettings
Parameters
cda Document
 A document.
Return Value
DefaultDivideSettings
 The DefaultDivideSettings object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace